app/controllers/v2/clubs_controller.rb

  def index
    @filter = ClubFilter.new filter_params.to_h
    @clubs  = @filter.empty? ? Club.all : Club.advanced_search(@filter)
---
SELECT "clubs".* FROM "clubs"

  def create
    @club = Club.new club_params

    if @club.save
---
INSERT INTO "clubs" ("title", "location", "description", "privacy_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test "], ["location", "test"], ["description", "test"], ["privacy_id", 2], ["created_at", "2015-03-18 21:20:40.758657"], ["updated_at", "2015-03-18 21:20:40.758657"]]

  def set_club
    @club = Club.find params[:id]
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT 1  [["id", 1]]