app/controllers/v2/profiles_controller.rb

  def update
    if current_user.update_with_password profile_params
---
UPDATE "users" SET "motorcycle_club" = $1, "riding_preference" = $2, "location" = $3, "time_zone" = $4, "about_me" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["motorcycle_club", ""], ["riding_preference", ""], ["location", ""], ["time_zone", ""], ["about_me", ""], ["updated_at", "2015-03-18 20:41:56.076786"], ["id", 1]]