app/controllers/v2/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @filter = UserFilter.new filter_params.to_h
    @users  = @filter.empty? ? User.all : current_user.friends_search(@filter)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def set_user
    @user = User.find params[:id]