app/views/v2/clubs/index.html.slim

          .b-form-row
            = f.input_field :club_type_id,
              collection: ClubType.all,
              include_blank: "Select Group Type",
              required: false
---
SELECT "club_types".* FROM "club_types"