app/views/v2/profiles/_form.html.slim

            label for="riding_preference_#{ rp.id }" = rp.title
            = check_box_tag :riding_preference_ids,
              rp.id,
              f.object.riding_preference_ids.include?(rp.id),
              id: "riding_preference_#{ rp.id }",
              name: "user[riding_preference_ids][]"
---
SELECT "user_riding_preferences".* FROM "user_riding_preferences" WHERE "user_riding_preferences"."user_id" = $1  [["user_id", 1]]