app/views/v2/partials/subheader/_current_user.html.slim

SELECT  "user_bikes".* FROM "user_bikes" WHERE "user_bikes"."user_id" = $1  ORDER BY "user_bikes"."model" ASC LIMIT 1  [["user_id", 1]]
---
      .address = current_user.location
      - current_user.user_bikes.first.try do |b|
        .bike = b.model