app/controllers/registrations_controller.rb

  def create
    @user = User.new(sign_up_params)
    if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "email", "encrypted_password", "zip", "fb_token", "app_settings", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

          if subscription.save
            @user.subscription = subscription
            @user.role = @plan.role
            @user.save!
---
UPDATE "users" SET "role_id" = $1, "authentication_token" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["role_id", 2], ["authentication_token", "jQ44JGXAfSZkKFpoJTLx"], ["updated_at", "2015-03-18 20:37:35.504392"], ["id", 1]]